/*******************************************************************************
*   文件名称 : RaidApp.cpp
*   作    者 : 王全宝
*   创建时间 : 2015/9/14   15:27
*   文件描述 : 
*   版权声明 : Copyright (C) 2014-2015 湖南安存科技有限公司
*   修改历史 : 2015/9/14   1.00 初始版本
*******************************************************************************/

#include "RaidApp.h"



#include "EasyLog.h"
#include "commdef.h"

CRaidApp* CRaidApp::m_pInstance = NULL;

/*******************************************************************************
* 函数名称  : Init
* 函数描述  : N/A
* 参数      : int argc
* 参数      : char * argv[]
* 返回值    : void
* 备注      : N/A
* 修改日期     修改人   修改内容
* -----------------------------------------------
* 2015/9/12   王全宝   新建
*******************************************************************************/
void CRaidApp::Init(int argc, char *argv[])
{
    //todo:初始化设置，构造IDiskInfo对象
}

/*******************************************************************************
* 函数名称  : Run
* 函数描述  : N/A
* 返回值    : void
* 备注      : N/A
* 修改日期     修改人   修改内容
* -----------------------------------------------
* 2015/9/12   王全宝   新建
*******************************************************************************/
void CRaidApp::Run()
{
    //todo:执行处理函数

}

/*******************************************************************************
* 函数名称  : GetInstance
* 函数描述  : N/A
* 返回值    : CRaidApp*
* 备注      : N/A
* 修改日期     修改人   修改内容
* -----------------------------------------------
* 2015/9/12   王全宝   新建
*******************************************************************************/
CRaidApp* CRaidApp::GetInstance()
{
    if (NULL == m_pInstance)
    {
        m_pInstance = new CRaidApp();
    }

    return m_pInstance;
}

/*******************************************************************************
* 函数名称  : ReleaseInstance
* 函数描述  : N/A
* 返回值    : void
* 备注      : N/A
* 修改日期     修改人   修改内容
* -----------------------------------------------
* 2015/9/12   王全宝   新建
*******************************************************************************/
void CRaidApp::ReleaseInstance()
{
    if (NULL != m_pInstance)
    {
        delete m_pInstance;
    }
}

CRaidApp::CRaidApp()
{
}


CRaidApp::~CRaidApp()
{
}
